Documents/ЗаявкаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗаявкаКлиента</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Заявки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИВремяВизита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенкулатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мастер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналыОбращения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
					<Comment>Оборудование и инструменты, применяемые при оказании услуг</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товары</Name>
					<Comment>Расходные материалы, используемые при оказании услуг</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>Услуги, оказываемые организацией</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>НДС по ставке  18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>НДС по ставке 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>НДС по ставке 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>Без НДС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>НДС по ставке 10%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаявкаКлиента/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьКонтрагентовПоставщиковПоТексту(ТекстПоиска) 
    Результат = Новый Массив;
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |  Контрагенты.Ссылка КАК Ссылка,
        |  Контрагенты.Наименование КАК Наименование
        |ИЗ
        |  Справочник.Контрагенты КАК Контрагенты
        |ГДЕ
        |  Контрагенты.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыКонтрагентов.Клиент)
        |  И Контрагенты.Наименование ПОДОБНО &ТекстПоиска";
    
    Запрос.УстановитьПараметр("ТекстПоиска", ТекстПоиска + "%");
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        Строка = Новый Структура("Ссылка, Наименование", ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование);  
        Результат.Добавить(Строка);
    КонецЦикла;
        
    Возврат Результат;
КонецФункции
                

&НаКлиенте
Процедура КлиентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если СтрДлина(Текст) < 1 Тогда  
        Возврат; 
	КонецЕсли;
	
	Результат = ПолучитьКонтрагентовПоставщиковПоТексту(Текст);                          
	Список = Новый СписокЗначений;  
	
	Для Каждого Строка Из Результат Цикл
    	Список.Добавить(Строка.Ссылка, Строка.Наименование);
	КонецЦикла;     
		
	ДанныеВыбора = Список;
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьУслугуПоТексту(ТекстПоиска) 
    Результат = Новый Массив;
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |  Номенклатура.Ссылка КАК Ссылка,
        |  Номенклатура.Наименование КАК Наименование
        |ИЗ
        |  Справочник.Номенклатура КАК Номенклатура
        |ГДЕ
        |  Номенклатура.ТипКонтрагента = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
        |  И Номенклатура.Наименование ПОДОБНО &ТекстПоиска";
    
    Запрос.УстановитьПараметр("ТекстПоиска", ТекстПоиска + "%");
    РезультатЗапроса = Запрос.Выполнить();
    ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    
    Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
        Строка = Новый Структура("Ссылка, Наименование", ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Наименование);  
        Результат.Добавить(Строка);
    КонецЦикла;
        
    Возврат Результат;
КонецФункции


&НаКлиенте
Процедура УслугаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если СтрДлина(Текст) < 1 Тогда  
        Возврат; 
	КонецЕсли;
	
	Результат = ПолучитьУслугуПоТексту(Текст);                          
	Список = Новый СписокЗначений;  
	
	Для Каждого Строка Из Результат Цикл
    	Список.Добавить(Строка.Ссылка, Строка.Наименование);
	КонецЦикла;     
		
	ДанныеВыбора = Список;
КонецПроцедуры
























&НаСервере
Процедура СуммаПриИзмененииНаСервере()
	ОбщаяСумма = 0;
	
	Для каждого СтрокаТЧ из Объект.Товары Цикл
		ОбщаяСумма = ОбщаяСумма + СтрокаТЧ.Всего;
	КонецЦикла;
	
	Объект.Сумма = ОбщаяСумма;
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	СуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВсегоПриИзменении(Элемент)
	СуммаПриИзмененииНаСервере();
КонецПроцедуры            



&НаСервере
Функция ПолучитьПроцентСтавкиНДС(СтавкаНДС) 
	ПроцентНДС = 0;
    
    Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
        ПроцентНДС = 18;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0") Тогда
        ПроцентНДС = 0;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
        ПроцентНДС = 20;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
        ПроцентНДС = 0;
    ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
        ПроцентНДС = 10;
    КонецЕсли;
    
    Возврат ПроцентНДС;
КонецФункции

&НаСервере
Процедура ПересчитатьТовары()  
    Для каждого Строка Из Объект.Товары Цикл
        Строка.Сумма = Строка.Количество * Строка.Цена;
        ПроцентНДС = ПолучитьПроцентСтавкиНДС(Строка.НДС);
        
        Если Объект.НДСВключенВСтоимость Тогда
            Строка.СуммаНДС = Строка.Сумма - (Строка.Сумма / (1 + ПроцентНДС / 100));
            Строка.Всего = Строка.Сумма;
        Иначе
            Строка.СуммаНДС = Строка.Сумма * ПроцентНДС / 100;
            Строка.Всего = Строка.Сумма + Строка.СуммаНДС;
        КонецЕсли;
	КонецЦикла;
	СуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
    ПересчитатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНДСПриИзменении(Элемент)
	ПересчитатьТовары();
КонецПроцедуры

&НаКлиенте
Процедура НДСВключенВСтоимостьПриИзменении(Элемент)
	ПересчитатьТовары();
КонецПроцедуры





&НаСервере
Процедура КомандаГрупповоеИзменениеНДСНаСервере(ВыбраннаяСтавкаНДС)
    Для каждого СтрокаТЧ Из Объект.Товары Цикл
        СтрокаТЧ.НДС = ВыбраннаяСтавкаНДС;
    КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура КомандаГрупповоеИзменениеНДС(Команда)  
	Форма = ПолучитьФорму("Перечисление.СтавкиНДС.ФормаВыбора", Форма);
	Форма.Открыть();
КонецПроцедуры              

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
    Сообщить(ВыбранноеЗначение); 
КонецПроцедуры  

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
    Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
        Сообщить("Не указана дата документа.");
        Отказ = Истина;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры
